---
title: InitialIlluminanceIntensity
classe: Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
namespace: Autodesk.Revit.DB.Lighting
eredita: Autodesk.Revit.DB.Lighting.InitialIntensity
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# InitialIlluminanceIntensity

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Distance { get; set; }` | `initialIlluminanceIntensity.Distance` | Double |
| `Double Illuminance { get; set; }` | `initialIlluminanceIntensity.Illuminance` | Double |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```